from django import forms

class UserForm(forms.Form):
    product_search = forms.CharField(
        label="Товар или продукт",
        widget=forms.TextInput(attrs={'placeholder': 'Например: Бумага офисная'})
    )
    product_attribute = forms.CharField(
        label="Доп. признаки (через запятую для 'И', через точку с запятой для 'ИЛИ')",
        required=False,
        widget=forms.TextInput(attrs={'placeholder': 'например: А4, белая'})
    )
    kod_regiona = forms.ChoiceField(
        choices=(('None', "Все регионы"),
                 (22, "Алтайский край"),
                 (28, "Амурская область"),
                 (29, "Архангельская область"),
                 (30, "Астраханская область"),
                 (31, "Белгородская область"),
                 (32, "Брянская область"),
                 (33, "Владимирская область"),
                 (34, "Волгоградская область"),
                 (35, "Вологодская область"),
                 (36, "Воронежская область"),
                 (79, "Еврейская автономная область"),
                 (75, "Забайкальский край"),
                 (37, "Ивановская область"),
                 (99, "Иные территории, включая город и космодром Байконур"),
                 (38, "Иркутская область"),
                 ("07", "Кабардино-Балкарская Республика"),
                 (39, "Калининградская область"),
                 (40, "Калужская область"),
                 (41, "Камчатский край"),
                 ("09", "Карачаево-Черкесская Республика"),
                 (42, "Кемеровская область"),
                 (43, "Кировская область"),
                 (44, "Костромская область"),
                 (23, "Краснодарский край"),
                 (24, "Красноярский край"),
                 (45, "Курганская область"),
                 (46, "Курская область"),
                 (47, "Ленинградская область"),
                 (48, "Липецкая область"),
                 (49, "Магаданская область"),
                 (77, "Москва"),
                 (50, "Московская область"),
                 (51, "Мурманская область"),
                 (83, "Ненецкий автономный округ"),
                 (52, "Нижегородская область"),
                 (53, "Новгородская область"),
                 (54, "Новосибирская область"),
                 (55, "Омская область"),
                 (56, "Оренбургская область"),
                 (57, "Орловская область"),
                 (58, "Пензенская область"),
                 (59, "Пермский край"),
                 (25, "Приморский край"),
                 (60, "Псковская область"),
                 ("01", "Республика Адыгея (Адыгея)"),
                 ("04", "Республика Алтай"),
                 ("02", "Республика Башкортостан"),
                 ("03", "Республика Бурятия"),
                 ("05", "Республика Дагестан"),
                 ("06", "Республика Ингушетия"),
                 ("08", "Республика Калмыкия"),
                 (10, "Республика Карелия"),
                 (11, "Республика Коми"),
                 (12, "Республика Марий Эл"),
                 (13, "Республика Мордовия"),
                 (14, "Республика Саха (Якутия)"),
                 (15, "Республика Северная Осетия - Алания"),
                 (16, "Республика Татарстан (Татарстан)"),
                 (17, "Республика Тыва"),
                 (19, "Республика Хакасия"),
                 (61, "Ростовская область"),
                 (62, "Рязанская область"),
                 (63, "Самарская область"),
                 (78, "Санкт-Петербург"),
                 (64, "Саратовская область"),
                 (65, "Сахалинская область"),
                 (66, "Свердловская область"),
                 (67, "Смоленская область"),
                 (26, "Ставропольский край"),
                 (68, "Тамбовская область"),
                 (69, "Тверская область"),
                 (70, "Томская область"),
                 (71, "Тульская область"),
                 (72, "Тюменская область"),
                 (18, "Удмуртская Республика"),
                 (73, "Ульяновская область"),
                 (27, "Хабаровский край"),
                 (86, "Ханты-Мансийский автономный округ - Югра"),
                 (74, "Челябинская область"),
                 (20, "Чеченская Республика"),
                 (21, "Чувашская Республика - Чувашия"),
                 (87, "Чукотский автономный округ"),
                 (89, "Ямало-Ненецкий автономный округ"),
                 (76, "Ярославская область")),
        label="Регион"
    )
    date_start = forms.DateField(
        label="Дата начала",
        widget=forms.DateInput(attrs={'type': 'date'}),
        initial=None
    )
    date_end = forms.DateField(
        label="Дата окончания",
        widget=forms.DateInput(attrs={'type': 'date'}),
        initial=None
    )
    fz = forms.ChoiceField(
        choices=(('All', "Все законы"), ('44', "ФЗ-44"), ('223', "ФЗ-223"), ('94', "ФЗ-94")),
        label="Закон (ФЗ)",
        required=False
    )
    price_min = forms.IntegerField(
        label="Мин. цена",
        required=False,
        widget=forms.NumberInput(attrs={'placeholder': '0'})
    )
    price_max = forms.IntegerField(
        label="Макс. цена",
        required=False,
        widget=forms.NumberInput(attrs={'placeholder': 'Без ограничений'})
    )
    okdp = forms.CharField(
        label="Код ОКДП/ОКПД",
        required=False,
        widget=forms.TextInput(attrs={'placeholder': 'Например: 18.11.11'})
    )

    required_css_class = "field"
    error_css_class = "error"
